app/controllers/songs_controller.rb

SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
<<<<<<< HEAD
      @artist = Artist.find_by(id: params[:artist_id])
      if @artist.nil?
        redirect_to artist_path, alert: 'Artist not found'
      else
        @songs = @artist.songs
      end
=======
      @songs = Artist.find(params[:artist_id]).songs
>>>>>>> 61fd7f9a7b5eb6878e85e79ec6e1dfc91b5cc5cf
    else
      @songs = Song.all